<a href="https://colab.research.google.com/github/Pattiecodes/DC_DS-in-R/blob/main/Module_5_Introduction_to_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# --- Module Start ---

# Querying the books table
You're ready to practice writing your first SQL queries using the SELECT and FROM keywords. Recall from the video that SELECT is used to choose the fields that will be included in the result set, while FROM is used to pick the table in which the fields are listed.

Feel free to explore books in the exercise.

Your task in this exercise is to practice selecting fields from books.

Instructions 1/3
35 XP
Select the title from the books table to view all book titles.

In [ ]:
-- Return all titles from the books table
SELECT title
FROM books;

Instructions 2/3
Select both the title and author fields from books.

In [ ]:
-- Select title and author from the books table
SELECT title, author
FROM books;

Instructions 3/3 Select all fields from the books table.

In [ ]:
-- Select all fields from the books table
SELECT *
FROM books;